Лицензия на программное обеспечение
Дата 10 июня 2021г.

Настоящая лицензия регламентирует использование следующего Программного
обеспечения:
* Библиотека Pybotx - сборник подпрограмм или объектов, используемых для
  разработки ботов, обеспечивающий интеграцию с ПО «Система коммуникаций
  Express».
* Авторский программный модуль (АПМ) (Asyncbox) - программная платформа для
  создания ботов для Системы коммуникаций Express.
* Библиотека FSM – сборник подпрограмм или объектов, используемых для
  разработки ботов, для представления и управления потоком выполнения команд
  ботов.
* Модуль Proxier – модуль ПО, позволяющий перенаправлять запросы на локально
  развернутого бота.
* ToDo Бот - индивидуальная разработка ООО «Анлимитед Продакшен» для
  демонстрации процесса и результата разработки ботов на платформе.
* Библиотека Pybotx Widgets – библиотека переиспользуемых компонентов для
  взаимодействия с пользователями.

Далее по тексту «Программное обеспечение» Правообладателем Программного
обеспечения является ООО «Анлимитед Продакшен» (ИНН: 7707374451, ОГРН:
5167746251240) Данная неисключительная лицензия разрешает лицам, получившим
законным способом копию программного кода Программного обеспечения и
сопутствующей документации, безвозмездно использовать Программное обеспечение
без ограничений, включая неограниченное право на использование, копирование,
доработку, адаптацию, публикацию, распространение, сублицензирование, при
соблюдении следующих условий:

Уведомление о правообладателе должны быть включены во все копии или значимые
части Программных продуктов, в том числе созданных с использованием
Программного обеспечения. Неисключительная лицензия ограничена «правом на
использование», ни одно из положений настоящей лицензии не означает передачи
кому бы то ни было исключительного права на Платформу, Библиотеки, Блоки и
любые элементы Программного обеспечения. Запрещается вносить изменения в
Программное обеспечение, переводить или создавать производные продукты,
основанные на Программном обеспечении и его элементах с целью регистрации
исключительных прав на программный код Программного обеспечения, а также
интегрировать Программное обеспечение или его элементы в другие результаты
интеллектуальной деятельности с последующей регистрацией исключительных прав на
Программное обеспечение в составе результатов интеллектуальной деятельности.

Неисключительная лицензия предоставляется на срок действия авторских прав на
территории всего мира. ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК
ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНО ВЫРАЖЕННЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ
ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ, СООТВЕТСТВИЯ ПО ЕГО КОНКРЕТНОМУ НАЗНАЧЕНИЮ И
ОТСУТСТВИЯ НАРУШЕНИЙ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ. НИ В КАКОМ СЛУЧАЕ АВТОРЫ ИЛИ
ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ПО КАКИМ-ЛИБО ИСКАМ, ЗА УЩЕРБ ИЛИ ПО
ИНЫМ ТРЕБОВАНИЯМ, В ТОМ ЧИСЛЕ, ПРИ ДЕЙСТВИИ КОНТРАКТА, ДЕЛИКТЕ ИЛИ ИНОЙ
СИТУАЦИИ, ВОЗНИКШИМ ИЗ-ЗА ИСПОЛЬЗОВАНИЯ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ИЛИ ИНЫХ
ДЕЙСТВИЙ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ. В ТОМ ЧИСЛЕ, НЕ ГАРАНТИРУЕТ (ВКЛЮЧАЯ, НО
НЕ ОГРАНИЧИВАЯСЬ): ПРИГОДНОСТЬ ДЛЯ КОНКРЕТНЫХ ЦЕЛЕЙ, ТОЧНОСТЬ, ПОЛНОТУ,
ПРОИЗВОДИТЕЛЬНОСТЬ, СИСТЕМНУЮ ИНТЕГРАЦИЮ, БЕСПЕРЕБОЙНОЕ ФУНКЦИОНИРОВАНИЕ,
ОТСУТСТВИЕ ОШИБОК, ИСПРАВЛЕНИЕ НЕПОЛАДОК, ЗАКОННОСТЬ ИСПОЛЬЗОВАНИЯ НА ЛЮБЫХ
ТЕРРИТОРИЯХ ЗА ПРЕДЕЛАМИ РОССИЙСКОЙ ФЕДЕРАЦИИ.
